# This file is automatically generated by MATLAB and may require you to modify it manually
[net]
angle=0
batch=64
burn_in=1000
channels=3
decay=0.0005
exposure=1.5
height=608
hue=.1
learning_rate=0.00261
max_batches=500500
momentum=0.949
mosaic=1
policy=steps
saturation=1.5
scales=.1,.1
steps=400000,450000
subdivisions=8
width=608

# darknet module ID:0
[convolutional]
batch_normalize=1
filters=32
pad=1
size=3
stride=1
activation=mish

# darknet module ID:1
[convolutional]
batch_normalize=1
filters=64
pad=1
size=3
stride=2
activation=mish

# darknet module ID:2
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=mish

# darknet module ID:3
[route]
layers=1

# darknet module ID:4
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=mish

# darknet module ID:5
[convolutional]
batch_normalize=1
filters=32
pad=1
size=1
stride=1
activation=mish

# darknet module ID:6
[convolutional]
batch_normalize=1
filters=64
pad=1
size=3
stride=1
activation=mish

# darknet module ID:7
[shortcut]
from=4
activation=linear

# darknet module ID:8
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=mish

# darknet module ID:9
[route]
layers=8,2

# darknet module ID:10
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=mish

# darknet module ID:11
[convolutional]
batch_normalize=1
filters=128
pad=1
size=3
stride=2
activation=mish

# darknet module ID:12
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=mish

# darknet module ID:13
[route]
layers=11

# darknet module ID:14
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=mish

# darknet module ID:15
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=mish

# darknet module ID:16
[convolutional]
batch_normalize=1
filters=64
pad=1
size=3
stride=1
activation=mish

# darknet module ID:17
[shortcut]
from=14
activation=linear

# darknet module ID:18
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=mish

# darknet module ID:19
[convolutional]
batch_normalize=1
filters=64
pad=1
size=3
stride=1
activation=mish

# darknet module ID:20
[shortcut]
from=17
activation=linear

# darknet module ID:21
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=mish

# darknet module ID:22
[route]
layers=21,12

# darknet module ID:23
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:24
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=2
activation=mish

# darknet module ID:25
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:26
[route]
layers=24

# darknet module ID:27
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:28
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:29
[convolutional]
batch_normalize=1
filters=128
pad=1
size=3
stride=1
activation=mish

# darknet module ID:30
[shortcut]
from=27
activation=linear

# darknet module ID:31
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:32
[convolutional]
batch_normalize=1
filters=128
pad=1
size=3
stride=1
activation=mish

# darknet module ID:33
[shortcut]
from=30
activation=linear

# darknet module ID:34
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:35
[convolutional]
batch_normalize=1
filters=128
pad=1
size=3
stride=1
activation=mish

# darknet module ID:36
[shortcut]
from=33
activation=linear

# darknet module ID:37
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:38
[convolutional]
batch_normalize=1
filters=128
pad=1
size=3
stride=1
activation=mish

# darknet module ID:39
[shortcut]
from=36
activation=linear

# darknet module ID:40
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:41
[convolutional]
batch_normalize=1
filters=128
pad=1
size=3
stride=1
activation=mish

# darknet module ID:42
[shortcut]
from=39
activation=linear

# darknet module ID:43
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:44
[convolutional]
batch_normalize=1
filters=128
pad=1
size=3
stride=1
activation=mish

# darknet module ID:45
[shortcut]
from=42
activation=linear

# darknet module ID:46
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:47
[convolutional]
batch_normalize=1
filters=128
pad=1
size=3
stride=1
activation=mish

# darknet module ID:48
[shortcut]
from=45
activation=linear

# darknet module ID:49
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:50
[convolutional]
batch_normalize=1
filters=128
pad=1
size=3
stride=1
activation=mish

# darknet module ID:51
[shortcut]
from=48
activation=linear

# darknet module ID:52
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=mish

# darknet module ID:53
[route]
layers=52,25

# darknet module ID:54
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:55
[convolutional]
batch_normalize=1
filters=512
pad=1
size=3
stride=2
activation=mish

# darknet module ID:56
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:57
[route]
layers=55

# darknet module ID:58
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:59
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:60
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=1
activation=mish

# darknet module ID:61
[shortcut]
from=58
activation=linear

# darknet module ID:62
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:63
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=1
activation=mish

# darknet module ID:64
[shortcut]
from=61
activation=linear

# darknet module ID:65
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:66
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=1
activation=mish

# darknet module ID:67
[shortcut]
from=64
activation=linear

# darknet module ID:68
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:69
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=1
activation=mish

# darknet module ID:70
[shortcut]
from=67
activation=linear

# darknet module ID:71
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:72
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=1
activation=mish

# darknet module ID:73
[shortcut]
from=70
activation=linear

# darknet module ID:74
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:75
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=1
activation=mish

# darknet module ID:76
[shortcut]
from=73
activation=linear

# darknet module ID:77
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:78
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=1
activation=mish

# darknet module ID:79
[shortcut]
from=76
activation=linear

# darknet module ID:80
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:81
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=1
activation=mish

# darknet module ID:82
[shortcut]
from=79
activation=linear

# darknet module ID:83
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=mish

# darknet module ID:84
[route]
layers=83,56

# darknet module ID:85
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=mish

# darknet module ID:86
[convolutional]
batch_normalize=1
filters=1024
pad=1
size=3
stride=2
activation=mish

# darknet module ID:87
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=mish

# darknet module ID:88
[route]
layers=86

# darknet module ID:89
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=mish

# darknet module ID:90
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=mish

# darknet module ID:91
[convolutional]
batch_normalize=1
filters=512
pad=1
size=3
stride=1
activation=mish

# darknet module ID:92
[shortcut]
from=89
activation=linear

# darknet module ID:93
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=mish

# darknet module ID:94
[convolutional]
batch_normalize=1
filters=512
pad=1
size=3
stride=1
activation=mish

# darknet module ID:95
[shortcut]
from=92
activation=linear

# darknet module ID:96
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=mish

# darknet module ID:97
[convolutional]
batch_normalize=1
filters=512
pad=1
size=3
stride=1
activation=mish

# darknet module ID:98
[shortcut]
from=95
activation=linear

# darknet module ID:99
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=mish

# darknet module ID:100
[convolutional]
batch_normalize=1
filters=512
pad=1
size=3
stride=1
activation=mish

# darknet module ID:101
[shortcut]
from=98
activation=linear

# darknet module ID:102
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=mish

# darknet module ID:103
[route]
layers=102,87

# darknet module ID:104
[convolutional]
batch_normalize=1
filters=1024
pad=1
size=1
stride=1
activation=mish

# darknet module ID:105
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:106
[convolutional]
batch_normalize=1
filters=1024
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:107
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:108
[maxpool]
size=5
stride=1

# darknet module ID:109
[route]
layers=107

# darknet module ID:110
[maxpool]
size=9
stride=1

# darknet module ID:111
[route]
layers=107

# darknet module ID:112
[maxpool]
size=13
stride=1

# darknet module ID:113
[route]
layers=112,110,108,107

# darknet module ID:114
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:115
[convolutional]
batch_normalize=1
filters=1024
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:116
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:117
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:118
[upsample]
stride=2

# darknet module ID:119
[route]
layers=85

# darknet module ID:120
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:121
[route]
layers=120,118

# darknet module ID:122
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:123
[convolutional]
batch_normalize=1
filters=512
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:124
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:125
[convolutional]
batch_normalize=1
filters=512
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:126
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:127
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:128
[upsample]
stride=2

# darknet module ID:129
[route]
layers=54

# darknet module ID:130
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:131
[route]
layers=130,128

# darknet module ID:132
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:133
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:134
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:135
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:136
[convolutional]
batch_normalize=1
filters=128
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:137
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:138
[convolutional]
filters=255
pad=1
size=1
stride=1
activation=linear

# darknet module ID:139
[yolo]
anchors=12,16,19,36,40,28,36,75,76,55,72,146,142,110,192,243,459,401
classes=80
ignore_thresh=0.7
jitter=0.3
mask=0,1,2
num=9
random=1
truth_thresh=1

# darknet module ID:140
[route]
layers=136

# darknet module ID:141
[convolutional]
batch_normalize=1
filters=256
pad=1
size=3
stride=2
activation=leaky

# darknet module ID:142
[route]
layers=141,126

# darknet module ID:143
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:144
[convolutional]
batch_normalize=1
filters=512
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:145
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:146
[convolutional]
batch_normalize=1
filters=512
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:147
[convolutional]
batch_normalize=1
filters=256
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:148
[convolutional]
batch_normalize=1
filters=512
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:149
[convolutional]
filters=255
pad=1
size=1
stride=1
activation=linear

# darknet module ID:150
[yolo]
anchors=12,16,19,36,40,28,36,75,76,55,72,146,142,110,192,243,459,401
classes=80
ignore_thresh=0.7
jitter=0.3
mask=3,4,5
num=9
random=1
truth_thresh=1

# darknet module ID:151
[route]
layers=147

# darknet module ID:152
[convolutional]
batch_normalize=1
filters=512
pad=1
size=3
stride=2
activation=leaky

# darknet module ID:153
[route]
layers=152,116

# darknet module ID:154
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:155
[convolutional]
batch_normalize=1
filters=1024
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:156
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:157
[convolutional]
batch_normalize=1
filters=1024
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:158
[convolutional]
batch_normalize=1
filters=512
pad=1
size=1
stride=1
activation=leaky

# darknet module ID:159
[convolutional]
batch_normalize=1
filters=1024
pad=1
size=3
stride=1
activation=leaky

# darknet module ID:160
[convolutional]
filters=255
pad=1
size=1
stride=1
activation=linear

# darknet module ID:161
[yolo]
anchors=12,16,19,36,40,28,36,75,76,55,72,146,142,110,192,243,459,401
classes=80
ignore_thresh=0.7
jitter=0.3
mask=6,7,8
num=9
random=1
truth_thresh=1

