# This file is generated by MATLAB
[net]
batch=64
subdivisions=32
width=480
height=480
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.001
burn_in=1000
max_batches=500200
policy=steps
steps=400000,450000
scales=.1,.1

# darknet module ID:0
[convolutional]
filters=32
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:1
[convolutional]
filters=64
size=3
pad=1
stride=2
activation=leaky
batch_normalize=1

# darknet module ID:2
[convolutional]
filters=32
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:3
[convolutional]
filters=64
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:4
[shortcut]
from=1
activation=linear

# darknet module ID:5
[convolutional]
filters=128
size=3
pad=1
stride=2
activation=leaky
batch_normalize=1

# darknet module ID:6
[convolutional]
filters=64
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:7
[convolutional]
filters=128
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:8
[shortcut]
from=5
activation=linear

# darknet module ID:9
[convolutional]
filters=64
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:10
[convolutional]
filters=128
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:11
[shortcut]
from=8
activation=linear

# darknet module ID:12
[convolutional]
filters=256
size=3
pad=1
stride=2
activation=leaky
batch_normalize=1

# darknet module ID:13
[convolutional]
filters=128
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:14
[convolutional]
filters=256
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:15
[shortcut]
from=12
activation=linear

# darknet module ID:16
[convolutional]
filters=128
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:17
[convolutional]
filters=256
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:18
[shortcut]
from=15
activation=linear

# darknet module ID:19
[convolutional]
filters=128
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:20
[convolutional]
filters=256
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:21
[shortcut]
from=18
activation=linear

# darknet module ID:22
[convolutional]
filters=128
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:23
[convolutional]
filters=256
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:24
[shortcut]
from=21
activation=linear

# darknet module ID:25
[convolutional]
filters=128
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:26
[convolutional]
filters=256
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:27
[shortcut]
from=24
activation=linear

# darknet module ID:28
[convolutional]
filters=128
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:29
[convolutional]
filters=256
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:30
[shortcut]
from=27
activation=linear

# darknet module ID:31
[convolutional]
filters=128
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:32
[convolutional]
filters=256
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:33
[shortcut]
from=30
activation=linear

# darknet module ID:34
[convolutional]
filters=128
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:35
[convolutional]
filters=256
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:36
[shortcut]
from=33
activation=linear

# darknet module ID:37
[convolutional]
filters=512
size=3
pad=1
stride=2
activation=leaky
batch_normalize=1

# darknet module ID:38
[convolutional]
filters=256
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:39
[convolutional]
filters=512
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:40
[shortcut]
from=37
activation=linear

# darknet module ID:41
[convolutional]
filters=256
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:42
[convolutional]
filters=512
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:43
[shortcut]
from=40
activation=linear

# darknet module ID:44
[convolutional]
filters=256
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:45
[convolutional]
filters=512
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:46
[shortcut]
from=43
activation=linear

# darknet module ID:47
[convolutional]
filters=256
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:48
[convolutional]
filters=512
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:49
[shortcut]
from=46
activation=linear

# darknet module ID:50
[convolutional]
filters=256
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:51
[convolutional]
filters=512
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:52
[shortcut]
from=49
activation=linear

# darknet module ID:53
[convolutional]
filters=256
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:54
[convolutional]
filters=512
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:55
[shortcut]
from=52
activation=linear

# darknet module ID:56
[convolutional]
filters=256
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:57
[convolutional]
filters=512
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:58
[shortcut]
from=55
activation=linear

# darknet module ID:59
[convolutional]
filters=256
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:60
[convolutional]
filters=512
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:61
[shortcut]
from=58
activation=linear

# darknet module ID:62
[convolutional]
filters=1024
size=3
pad=1
stride=2
activation=leaky
batch_normalize=1

# darknet module ID:63
[convolutional]
filters=512
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:64
[convolutional]
filters=1024
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:65
[shortcut]
from=62
activation=linear

# darknet module ID:66
[convolutional]
filters=512
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:67
[convolutional]
filters=1024
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:68
[shortcut]
from=65
activation=linear

# darknet module ID:69
[convolutional]
filters=512
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:70
[convolutional]
filters=1024
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:71
[shortcut]
from=68
activation=linear

# darknet module ID:72
[convolutional]
filters=512
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:73
[convolutional]
filters=1024
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:74
[shortcut]
from=71
activation=linear

# darknet module ID:75
[convolutional]
filters=512
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:76
[convolutional]
filters=1024
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:77
[convolutional]
filters=512
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:78
[maxpool]
size=5
stride=1

# darknet module ID:79
[route]
layers=77

# darknet module ID:80
[maxpool]
size=9
stride=1

# darknet module ID:81
[route]
layers=77

# darknet module ID:82
[maxpool]
size=13
stride=1

# darknet module ID:83
[route]
layers=77,78,80,82

# darknet module ID:84
[convolutional]
filters=512
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:85
[convolutional]
filters=1024
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:86
[convolutional]
filters=512
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:87
[convolutional]
filters=1024
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:88
[convolutional]
filters=18
size=1
pad=0
stride=1
activation=linear

# darknet module ID:89
[yolo]
mask = 0,1,2
anchors = 11,22,  12,9,  13,8,  13,22,  15,9,  17,19,  18,9,  20,33,  21,41,  26,46,  28,17,  28,40
classes=1
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1


# darknet module ID:90
[route]
layers=86

# darknet module ID:91
[convolutional]
filters=128
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:92
[upsample]
stride=2

# darknet module ID:93
[route]
layers=61,92

# darknet module ID:94
[convolutional]
filters=64
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:95
[convolutional]
filters=18
size=1
pad=0
stride=1
activation=linear

# darknet module ID:96
[yolo]
mask = 0,1,2
anchors = 11,22,  12,9,  13,8,  13,22,  15,9,  17,19,  18,9,  20,33,  21,41,  26,46,  28,17,  28,40
classes=1
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1


# darknet module ID:97
[route]
layers=94

# darknet module ID:98
[upsample]
stride=2

# darknet module ID:99
[route]
layers=36,98

# darknet module ID:100
[convolutional]
filters=64
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:101
[convolutional]
filters=18
size=1
pad=0
stride=1
activation=linear

# darknet module ID:102
[yolo]
mask = 0,1,2
anchors = 11,22,  12,9,  13,8,  13,22,  15,9,  17,19,  18,9,  20,33,  21,41,  26,46,  28,17,  28,40
classes=1
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1


# darknet module ID:103
[route]
layers=100

# darknet module ID:104
[upsample]
stride=2

# darknet module ID:105
[route]
layers=11,104

# darknet module ID:106
[convolutional]
filters=64
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:107
[convolutional]
filters=18
size=1
pad=0
stride=1
activation=linear

# darknet module ID:108
[yolo]
mask = 0,1,2
anchors = 11,22,  12,9,  13,8,  13,22,  15,9,  17,19,  18,9,  20,33,  21,41,  26,46,  28,17,  28,40
classes=1
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1


# darknet module ID:109
[route]
layers=106

# darknet module ID:110
[upsample]
stride=2

# darknet module ID:111
[route]
layers=4,110

# darknet module ID:112
[convolutional]
filters=64
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:113
[convolutional]
filters=18
size=1
pad=0
stride=1
activation=linear

# darknet module ID:114
[yolo]
mask = 0,1,2
anchors = 11,22,  12,9,  13,8,  13,22,  15,9,  17,19,  18,9,  20,33,  21,41,  26,46,  28,17,  28,40
classes=1
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1


