# This file is automatically generated by MATLAB and may require you to modify it manually
[net]
angle=7
aspect=0.75
batch=64
channels=3
exposure=0.75
height=224
learning_rate=0.01
max_batches=600000
max_crop=256
momentum=0.9
policy=poly
power=4
saturation=0.75
subdivisiions=1
width=224

# darknet module ID:0
[convolutional]
batch_normalize=1
filters=32
pad=0
size=3
stride=2
activation=relu6

# darknet module ID:1
[convolutional]
batch_normalize=1
filters=32
groups=32
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:2
[convolutional]
batch_normalize=1
filters=16
pad=1
size=1
stride=1
activation=linear

# darknet module ID:3
[convolutional]
batch_normalize=1
filters=96
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:4
[convolutional]
batch_normalize=1
filters=96
groups=96
pad=0
size=3
stride=2
activation=relu6

# darknet module ID:5
[convolutional]
batch_normalize=1
filters=24
pad=1
size=1
stride=1
activation=linear

# darknet module ID:6
[convolutional]
batch_normalize=1
filters=144
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:7
[convolutional]
batch_normalize=1
filters=144
groups=144
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:8
[convolutional]
batch_normalize=1
filters=24
pad=1
size=1
stride=1
activation=linear

# darknet module ID:9
[shortcut]
from=5
activation=linear

# darknet module ID:10
[convolutional]
batch_normalize=1
filters=144
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:11
[convolutional]
batch_normalize=1
filters=144
groups=144
pad=0
size=3
stride=2
activation=relu6

# darknet module ID:12
[convolutional]
batch_normalize=1
filters=32
pad=1
size=1
stride=1
activation=linear

# darknet module ID:13
[convolutional]
batch_normalize=1
filters=192
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:14
[convolutional]
batch_normalize=1
filters=192
groups=192
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:15
[convolutional]
batch_normalize=1
filters=32
pad=1
size=1
stride=1
activation=linear

# darknet module ID:16
[shortcut]
from=12
activation=linear

# darknet module ID:17
[convolutional]
batch_normalize=1
filters=192
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:18
[convolutional]
batch_normalize=1
filters=192
groups=192
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:19
[convolutional]
batch_normalize=1
filters=32
pad=1
size=1
stride=1
activation=linear

# darknet module ID:20
[shortcut]
from=16
activation=linear

# darknet module ID:21
[convolutional]
batch_normalize=1
filters=192
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:22
[convolutional]
batch_normalize=1
filters=192
groups=192
pad=0
size=3
stride=2
activation=relu6

# darknet module ID:23
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=linear

# darknet module ID:24
[convolutional]
batch_normalize=1
filters=384
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:25
[convolutional]
batch_normalize=1
filters=384
groups=384
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:26
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=linear

# darknet module ID:27
[shortcut]
from=23
activation=linear

# darknet module ID:28
[convolutional]
batch_normalize=1
filters=384
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:29
[convolutional]
batch_normalize=1
filters=384
groups=384
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:30
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=linear

# darknet module ID:31
[shortcut]
from=27
activation=linear

# darknet module ID:32
[convolutional]
batch_normalize=1
filters=384
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:33
[convolutional]
batch_normalize=1
filters=384
groups=384
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:34
[convolutional]
batch_normalize=1
filters=64
pad=1
size=1
stride=1
activation=linear

# darknet module ID:35
[shortcut]
from=31
activation=linear

# darknet module ID:36
[convolutional]
batch_normalize=1
filters=384
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:37
[convolutional]
batch_normalize=1
filters=384
groups=384
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:38
[convolutional]
batch_normalize=1
filters=96
pad=1
size=1
stride=1
activation=linear

# darknet module ID:39
[convolutional]
batch_normalize=1
filters=576
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:40
[convolutional]
batch_normalize=1
filters=576
groups=576
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:41
[convolutional]
batch_normalize=1
filters=96
pad=1
size=1
stride=1
activation=linear

# darknet module ID:42
[shortcut]
from=38
activation=linear

# darknet module ID:43
[convolutional]
batch_normalize=1
filters=576
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:44
[convolutional]
batch_normalize=1
filters=576
groups=576
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:45
[convolutional]
batch_normalize=1
filters=96
pad=1
size=1
stride=1
activation=linear

# darknet module ID:46
[shortcut]
from=42
activation=linear

# darknet module ID:47
[convolutional]
batch_normalize=1
filters=576
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:48
[convolutional]
batch_normalize=1
filters=576
groups=576
pad=0
size=3
stride=2
activation=relu6

# darknet module ID:49
[convolutional]
batch_normalize=1
filters=160
pad=1
size=1
stride=1
activation=linear

# darknet module ID:50
[convolutional]
batch_normalize=1
filters=960
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:51
[convolutional]
batch_normalize=1
filters=960
groups=960
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:52
[convolutional]
batch_normalize=1
filters=160
pad=1
size=1
stride=1
activation=linear

# darknet module ID:53
[shortcut]
from=49
activation=linear

# darknet module ID:54
[convolutional]
batch_normalize=1
filters=960
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:55
[convolutional]
batch_normalize=1
filters=960
groups=960
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:56
[convolutional]
batch_normalize=1
filters=160
pad=1
size=1
stride=1
activation=linear

# darknet module ID:57
[shortcut]
from=53
activation=linear

# darknet module ID:58
[convolutional]
batch_normalize=1
filters=960
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:59
[convolutional]
batch_normalize=1
filters=960
groups=960
pad=1
size=3
stride=1
activation=relu6

# darknet module ID:60
[convolutional]
batch_normalize=1
filters=320
pad=1
size=1
stride=1
activation=linear

# darknet module ID:61
[convolutional]
batch_normalize=1
filters=1280
pad=1
size=1
stride=1
activation=relu6

# darknet module ID:62
[avgpool]

# darknet module ID:63
[connected]
output=1000
activation=linear

# darknet module ID:64
[softmax]
groups=1

